# ─────────────────────────────────────────────────────────────────────────────
# Brewfile — Homebrew packages for macOS development environment
# ─────────────────────────────────────────────────────────────────────────────
# Install with:  brew bundle --file=Brewfile
# ─────────────────────────────────────────────────────────────────────────────

# ── Taps ──────────────────────────────────────────────────────────────────────
tap "homebrew/bundle"

# ── CLI Tools ─────────────────────────────────────────────────────────────────
brew "cmake"
brew "curl"
brew "fastfetch"
brew "gh"
brew "gnupg"
brew "pinentry-mac"
brew "stow"
brew "tectonic"

# ── Shell ─────────────────────────────────────────────────────────────────────
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ── Languages & Runtimes ─────────────────────────────────────────────────────
brew "node"
brew "php"
brew "python@3.13"

# ── Databases ─────────────────────────────────────────────────────────────────
brew "mariadb"

# ── Casks (GUI Applications) ─────────────────────────────────────────────────
cask "discord"
cask "firefox"
cask "kitty"
cask "stats"
cask "visual-studio-code"

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
